//
// Copyright (c) 2007-2016 Dell Inc. All rights reserved. This
// software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Dell Inc.
//
// SecureBootStrings.uni
//

#langdef   en-US "English"
#langdef   tm-CL "Theme"

#include "Library\DellSetupCommonStrs.uni"

//
// Expert Key Management
//
#string STR_EXPERT_KEY                  #language en-US "Expert Key Management"
#string STR_EXPERT_KEY_HELP             #language en-US ""
#string STR_CUSTOM_MODE                 #language en-US "Enable Custom Mode"
#string STR_CUSTOM_MODE_HELP            #language en-US "Expert Key Management allows the PK, KEK, db, and dbx security key databases to be manipulated.\n"
                                                        "Select Enable Custom Mode to allow keys in the PK, KEK, db, and dbx security key databases to be modified.\n"
                                                        "If Custom Mode is not enabled, any changes made with respect to the keys will not be saved.\n"
                                                        "\n"
                                                        "Save to File will save the key to a user-selected file.\n"
                                                        "Replace from File will replace the current key with a key from a user-selected file.\n"
                                                        "Append from File will add a key to the current database from a user-selected file.\n"
                                                        "Delete will delete the selected key.\n"
                                                        "Reset All Keys will reset all four keys to their default setting."

#string STR_DELETE_ALL_KEYS_WARNING     #language en-US "Are you sure you want to delete all keys?"
#string STR_RESET_ALL_KEYS_WARNING      #language en-US "Are you sure you want to reset all keys?"

#string STR_CUSTOM_MODE_LABEL           #language en-US "Custom Mode Key Management"

// Custom Modes
#string STR_CUSTOM_MODE_SELECT          #language en-US "Select Key Database"
#string STR_PK_CUSTOM_MODE              #language en-US "PK"
#string STR_KEK_CUSTOM_MODE             #language en-US "KEK"
#string STR_DB_CUSTOM_MODE              #language en-US "db"
#string STR_DBX_CUSTOM_MODE             #language en-US "dbx"

// Buttons
#string STR_SAVE_TO_FILE                #language en-US "Save to File"
#string STR_REPLACE_FILE                #language en-US "Replace from File"
#string STR_APPEND_FILE                 #language en-US "Append from File"
#string STR_DELETE                      #language en-US "Delete"
#string STR_RESET_ALL_KEYS              #language en-US "Reset All Keys"
#string STR_DELETE_ALL_KEYS             #language en-US "Delete All Keys"

//
// Misc.
//
#string STR_GENERAL_DEVICE_PATH         #language en-US ""
